In [1]:
person = {
    "first": "Oluwafemi",
    "last": "Olasegiri",
    "email": "olasegirioluwafemi@gmail.com"
}

In [2]:
people = {
    "first": "Oluwafemi",
    "last": "Olasegiri",
    "email": "olasegirioluwafemi@gmail.com"
}

In [3]:
people = {
    "first": ["Oluwafemi", "boy", "chris"],
    "last": ["Olasegiri", "boy", "buns"],
    "email": ["olasegirioluwafemi@gmail.com", "bouncingboy@gmail.com", "chrisbuns@gmail.com"]
}

In [4]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame(people)

In [6]:
df

       first       last                         email
0  Oluwafemi  Olasegiri  olasegirioluwafemi@gmail.com
1        boy        boy         bouncingboy@gmail.com
2      chris       buns           chrisbuns@gmail.com

In [7]:
df.set_index('email', inplace=True)

In [8]:
df

                                  first       last
email
olasegirioluwafemi@gmail.com  Oluwafemi  Olasegiri
bouncingboy@gmail.com               boy        boy
chrisbuns@gmail.com               chris       buns

In [9]:
df.index

Index(['olasegirioluwafemi@gmail.com', 'bouncingboy@gmail.com',
       'chrisbuns@gmail.com'],
      dtype='object', name='email')

In [10]:
df.loc['olasegirioluwafemi@gmail.com', 'last']

'Olasegiri'

In [11]:
df.reset_index(inplace=True)

In [12]:
df

                          email      first       last
0  olasegirioluwafemi@gmail.com  Oluwafemi  Olasegiri
1         bouncingboy@gmail.com        boy        boy
2           chrisbuns@gmail.com      chris       buns

In [13]:
type(df['email'])

pandas.core.series.Series

In [14]:
df['email']

0    olasegirioluwafemi@gmail.com
1           bouncingboy@gmail.com
2             chrisbuns@gmail.com
Name: email, dtype: object

In [15]:
df.count

<bound method DataFrame.count of                           email      first       last
0  olasegirioluwafemi@gmail.com  Oluwafemi  Olasegiri
1         bouncingboy@gmail.com        boy        boy
2           chrisbuns@gmail.com      chris       buns>

In [16]:
df[['first', 'last']]

       first       last
0  Oluwafemi  Olasegiri
1        boy        boy
2      chris       buns

In [17]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [18]:
df.iloc[0]

email    olasegirioluwafemi@gmail.com
first                       Oluwafemi
last                        Olasegiri
Name: 0, dtype: object

In [19]:
df.loc[[0, 1, 2], ['first']]

       first
0  Oluwafemi
1        boy
2      chris

In [20]:
filt = (df['last'] == 'boy')
df[filt]

                   email first last
1  bouncingboy@gmail.com   boy  boy

In [21]:
df.loc[filt, 'email']

1    bouncingboy@gmail.com
Name: email, dtype: object

In [22]:
filtOr = (df['first'] == 'boy') | (df['first'] == 'chris')

In [23]:
df.loc[filtOr]

                   email  first  last
1  bouncingboy@gmail.com    boy   boy
2    chrisbuns@gmail.com  chris  buns

In [24]:
df.loc[filtOr, 'first'] = 'toy'

In [25]:
df

                          email      first       last
0  olasegirioluwafemi@gmail.com  Oluwafemi  Olasegiri
1         bouncingboy@gmail.com        toy        boy
2           chrisbuns@gmail.com        toy       buns

In [26]:
df['first'].str.upper()

0    OLUWAFEMI
1          TOY
2          TOY
Name: first, dtype: object

In [27]:
df['first'] = df['first'].str.upper()

In [28]:
df

                          email      first       last
0  olasegirioluwafemi@gmail.com  OLUWAFEMI  Olasegiri
1         bouncingboy@gmail.com        TOY        boy
2           chrisbuns@gmail.com        TOY       buns

In [29]:
df['email'].apply(len)

0    28
1    21
2    19
Name: email, dtype: int64

In [30]:
def update_email(email):
    return email.lower()
def update_first(first):
    return first.lower()
def update_last(last):
    return last.lower()

In [31]:
df['email'].apply(update_email)

0    olasegirioluwafemi@gmail.com
1           bouncingboy@gmail.com
2             chrisbuns@gmail.com
Name: email, dtype: object

In [32]:
df['email'] = df['email'].apply(update_email)
df['first'] = df['first'].apply(update_first)
df['last'] = df['last'].apply(update_last)

In [33]:
df

                          email      first       last
0  olasegirioluwafemi@gmail.com  oluwafemi  olasegiri
1         bouncingboy@gmail.com        toy        boy
2           chrisbuns@gmail.com        toy       buns

In [34]:
df['first'] = df['first'].apply(lambda x: x.upper())

In [35]:
df

                          email      first       last
0  olasegirioluwafemi@gmail.com  OLUWAFEMI  olasegiri
1         bouncingboy@gmail.com        TOY        boy
2           chrisbuns@gmail.com        TOY       buns

In [36]:
df.apply(len)

email    3
first    3
last     3
dtype: int64

In [37]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [38]:
df.apply(pd.Series.min)

email    bouncingboy@gmail.com
first                OLUWAFEMI
last                       boy
dtype: object

In [39]:
df.apply(lambda x: x.min())

email    bouncingboy@gmail.com
first                OLUWAFEMI
last                       boy
dtype: object

In [40]:
df.applymap(str.upper)

                          email      first       last
0  OLASEGIRIOLUWAFEMI@GMAIL.COM  OLUWAFEMI  OLASEGIRI
1         BOUNCINGBOY@GMAIL.COM        TOY        BOY
2           CHRISBUNS@GMAIL.COM        TOY       BUNS

In [41]:
df['first'].map({'OLUWAFEMI': 'Bola', 'TOY': 'Bolu'})

0    Bola
1    Bolu
2    Bolu
Name: first, dtype: object

In [42]:
df

                          email      first       last
0  olasegirioluwafemi@gmail.com  OLUWAFEMI  olasegiri
1         bouncingboy@gmail.com        TOY        boy
2           chrisbuns@gmail.com        TOY       buns

In [43]:
df['first'] = df['first'].map({'OLUWAFEMI': 'Bola', 'TOY': 'Bolu'})

In [44]:
df

                          email first       last
0  olasegirioluwafemi@gmail.com  Bola  olasegiri
1         bouncingboy@gmail.com  Bolu        boy
2           chrisbuns@gmail.com  Bolu       buns

In [45]:
df['fullname'] = df['first'] + ' ' + df['last']

In [46]:
df

                          email first       last        fullname
0  olasegirioluwafemi@gmail.com  Bola  olasegiri  Bola olasegiri
1         bouncingboy@gmail.com  Bolu        boy        Bolu boy
2           chrisbuns@gmail.com  Bolu       buns       Bolu buns

In [47]:
df.drop(columns=['first', 'last'], inplace=True)

In [48]:
df

                          email        fullname
0  olasegirioluwafemi@gmail.com  Bola olasegiri
1         bouncingboy@gmail.com        Bolu boy
2           chrisbuns@gmail.com       Bolu buns

In [49]:
df['fullname'].str.split(' ', expand=True)

      0          1
0  Bola  olasegiri
1  Bolu        boy
2  Bolu       buns

In [50]:
df[['first', 'last']] = df['fullname'].str.split(' ', expand=True)

In [51]:
df

                          email        fullname first       last
0  olasegirioluwafemi@gmail.com  Bola olasegiri  Bola  olasegiri
1         bouncingboy@gmail.com        Bolu boy  Bolu        boy
2           chrisbuns@gmail.com       Bolu buns  Bolu       buns

In [52]:
df.sort_values(by=['first', 'last'], ascending=[True, True])

                          email        fullname first       last
0  olasegirioluwafemi@gmail.com  Bola olasegiri  Bola  olasegiri
1         bouncingboy@gmail.com        Bolu boy  Bolu        boy
2           chrisbuns@gmail.com       Bolu buns  Bolu       buns

In [53]:

people = {
    "first": ["Oluwafemi", "Jane", "John", "Chris", np.nan, None, 'NA'],
    "last": ["Olasegiri", "Doe", "Doe", "Olasegiri", np.nan, np.nan, 'Missing'],
    "email": ["olasegirioluwafemi@gmail.com", "JaneDoe@gmail.com", "JohnDoe@gmail.com", None, np.nan, "Anonymous@gmail.com"],
    "age": ['33', '55', '63', '36', None, None, 'Missing'],
}

In [54]:
df = pd.DataFrame(people)
df

ValueError: All arrays must be of the same length